from pathlib import Path


TITLES = [
    "Война и мир",
    "Идиот",
    "Преступление и наказание",
    "Мастер и Маргарита",
    "Ася",
    "Обломов",
    "Три товарища",
    "Трудно быть богом",
    "Чистый код",
    "Гарри Поттер и философский камень",
]

AUTHORS = [
    "Лев Толстой",
    "Фёдор Достоевский",
    "Михаил Булгаков",
    "Иван Тургенев",
    "Александр Грибоедов",
    "Эрих Мария Ремарк",
    "Аркадий Стругацкий",
    "Роберт Мартин",
    "Джоан Роулинг",
]

GENRES = [
    "роман",
    "фантастика",
    "драма",
    "история",
    "фэнтези",
    "учебник",
    "научпоп",
]

FIELDS = [
    "math",
    "physics",
    "chemistry",
    "biology",
    "cs",
    "economics",
    "history",
]

ISBN_ALPH = '0123456789-'

LOG_FILE = Path(__file__).resolve().parents[1] / 'shell.log'
LOG_TIME_FORMAT = '%Y-%m-%d %H:%M:%S'
LOG_FORMAT = "[%(asctime)s] [%(levelname)s] %(message)s"
